abseil-cpp
acl
acpilight
adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adobe-source-han-sans-tw-fonts
adwaita-cursors
adwaita-icon-theme
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-file-transfer
android-udev
aom
archlinux-keyring
argon2
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
babl
base
base-devel
bash
bash-completion
bc
binutils
bison
blas
bluez-libs
bmon
boost-libs
box2d
bridge-utils
brotli
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
cantarell-fonts
cblas
cdparanoia
cifs-utils
clang
clucene
cmake
cmatrix
colord
colord-gtk
colord-gtk-common
compiler-rt
confuse
containerd
coreutils
cpio
cppdap
cryptsetup
cups
cups-filters
curl
darktable
dav1d
db
db5.3
dbus
dbus-glib
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
dialog
diffutils
discord
dnssec-anchors
docker
dosbox
double-conversion
dracut
duktape
dunst
e2fsprogs
egl-wayland
eglexternalplatform
exiv2
expat
fakeroot
feh
ffmpeg
ffmpegthumbnailer
fftw
file
filesystem
findutils
firefox
flac
flex
flickcurl
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse2
gawk
gc
gcc
gcc-libs
gd
gdbm
gdk-pixbuf2
gegl
gettext
giflib
gimp
girara
git
glew
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
gmic
gmime3
gmp
gnupg
gnutls
go
gobject-introspection-runtime
gperftools
gpgme
gpm
gptfdisk
graphene
graphicsmagick
graphite
grep
groff
grub
gsasl
gsettings-desktop-schemas
gsfonts
gsimplecal
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm-4.0
gtkmm3
guile
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
highway
htop
hunspell
hwdata
hwloc
hyphen
iana-etc
icu
imath
imlib2
intel-undervolt
iproute2
iptables
iputils
iso-codes
isync
jack2
jansson
jasper
jbigkit
json-c
json-glib
jsoncpp
kbd
keyutils
kmod
krb5
kyotocabinet
l-smash
lame
lapack
lcms2
ldb
ldns
lensfun
less
lib32-acl
lib32-alsa-lib
lib32-alsa-plugins
lib32-at-spi2-core
lib32-brotli
lib32-bzip2
lib32-cairo
lib32-colord
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-flac
lib32-fontconfig
lib32-freetype2
lib32-fribidi
lib32-gcc-libs
lib32-gdk-pixbuf2
lib32-gettext
lib32-giflib
lib32-glib2
lib32-glibc
lib32-gmp
lib32-gnutls
lib32-gst-plugins-base-libs
lib32-gstreamer
lib32-gtk3
lib32-harfbuzz
lib32-icu
lib32-keyutils
lib32-krb5
lib32-lcms2
lib32-libasyncns
lib32-libcanberra
lib32-libcap
lib32-libcups
lib32-libdatrie
lib32-libdrm
lib32-libelf
lib32-libepoxy
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libjpeg-turbo
lib32-libldap
lib32-libltdl
lib32-libnl
lib32-libogg
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libpsl
lib32-libpulse
lib32-librsvg
lib32-libsndfile
lib32-libssh2
lib32-libtasn1
lib32-libthai
lib32-libtiff
lib32-libtirpc
lib32-libunistring
lib32-libunwind
lib32-libvorbis
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcomposite
lib32-libxcrypt
lib32-libxcursor
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxft
lib32-libxi
lib32-libxinerama
lib32-libxkbcommon
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxslt
lib32-libxss
lib32-libxtst
lib32-libxv
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-mpg123
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-ocl-icd
lib32-openal
lib32-openssl
lib32-opus
lib32-orc
lib32-p11-kit
lib32-pam
lib32-pango
lib32-pcre2
lib32-pixman
lib32-sdl2
lib32-sqlite
lib32-systemd
lib32-tdb
lib32-util-linux
lib32-v4l-utils
lib32-vkd3d
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libb2
libb64
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcolord
libconfig
libcups
libdaemon
libdatrie
libdc1394
libde265
libdecor
libdeflate
libdrm
libdvdnav
libdvdread
libe-book
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libffi
libfontenc
libfreehand
libgcrypt
libgexiv2
libgirepository
libglvnd
libgpg-error
libgphoto2
libgudev
libgusb
libheif
libice
libidn
libidn2
libiec61883
libieee1284
libimagequant
libinih
libinput
libisl
libixion
libjpeg-turbo
libjxl
libksba
liblangtag
libldap
libluv
liblzf
libmd
libmfx
libmikmod
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmspack
libmspub
libmtp
libmwaw
libmypaint
libnatpmp
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnice
libnl
libnm
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
libopenmpt
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libpng
libproxy
libpsl
libpulse
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
librevenge
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspiro
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtpms
libunistring
libunwind
liburing
libusb
libutempter
libuv
libva
libvdpau
libverto
libvisio
libvorbis
libvpx
libvterm
libwacom
libwbclient
libwebp
libwmf
libwpd
libwpg
libwps
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmu
libxnvctrl
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
linux
linux-api-headers
linux-firmware
linux-firmware-whence
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua53
luajit
lynx
lz4
lzo
m4
mailcap
maim
make
man-db
man-pages
mbedtls
md4c
mdadm
mesa
mesa-utils
miniupnpc
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpfr
mpg123
mpv
msgpack-c
msmtp
mtdev
mujs
mypaint-brushes1
ncurses
neofetch
neomutt
neon
neovim
net-snmp
nettle
networkmanager
newsboat
notmuch-runtime
noto-fonts
noto-fonts-emoji
npth
nspr
nss
ntfs-3g
numlockx
nvidia
nvidia-prime
nvidia-settings
nvidia-utils
nvtop
obs-studio
ocl-icd
odt2txt
onetbb
openal
opencore-amr
opencv
openexr
openjpeg2
openmp
openmpi
openpmix
openssh
openssl
opus
orc
osm-gps-map
p11-kit
p7zip
pacman
pacman-mirrorlist
pam
pambase
pamixer
pango
pangomm
pangomm-2.48
parted
pass
passff-host
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-image-exiftool
perl-mailtools
perl-timedate
picom
pinentry
pipewire
pixman
pkgconf
polkit
poppler
poppler-data
poppler-glib
popt
portaudio
procps-ng
protobuf
psmisc
pugixml
pulseaudio
pulseaudio-alsa
pybind11
python
python-attrs
python-bottle
python-certifi
python-cffi
python-cryptography
python-docopt
python-gobject
python-greenlet
python-keyutils
python-msgpack
python-packaging
python-pillow
python-pip
python-ply
python-pycparser
python-pynvim
python-watchdog
python-wheel
python-yaml
qpdf
qt5-base
qt5-tools
qt5-translations
qt5-x11extras
qt6-base
qt6-svg
qt6-translations
ranger
raptor
rasqal
rav1e
readline
redland
rhash
rnnoise
rtkit
rubberband
runc
samba
sane
schedtool
sdl12-compat
sdl2
sdl_net
sdl_sound
sed
sfml
sfsexp
shaderc
shadow
shared-mime-info
slang
slop
smbclient
sound-theme-freedesktop
speedcrunch
speex
speexdsp
spirv-tools
sqlite
srt
steam
stfl
sudo
suitesparse
svt-av1
sysstat
systemd
systemd-libs
systemd-sysvcompat
talloc
tar
tdb
tevent
texinfo
tpm2-tss
tracker3
transmission-gtk
tree
tree-sitter
tslib
tzdata
uchardet
udiskie
udisks2
ueberzug
unibilium
usbutils
util-linux
util-linux-libs
v4l-utils
vbam-wx
vid.stab
vim
vim-runtime
virtualbox
virtualbox-guest-iso
virtualbox-host-modules-arch
vkd3d
vmaf
volume_key
vulkan-headers
vulkan-icd-loader
vulkan-intel
vulkan-tools
w3m
wayland
wayland-protocols
webrtc-audio-processing
wget
which
wine
wine-gecko
wine-mono
wpa_supplicant
wxwidgets-common
wxwidgets-gtk3
x264
x265
xapian-core
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xclip
xdg-utils
xdotool
xf86-input-libinput
xf86-video-intel
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xinit
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorgproto
xvidcore
xz
yt-dlp
zathura
zathura-pdf-poppler
zenity
zeromq
zimg
zip
zlib
zstd
zxing-cpp
